dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  // Disable GPIO PortF module
  //SysCtlPeripheralDisable(SYSCTL_PERIPH_GPIOE);

  // Disable interrupts associated with the switch
  GPIOPinIntDisable(GPIO_PORTE_BASE, GPIO_PIN_1);
  
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  IntDisable(INT_GPIOE); 
  
  return SUCCESS;

}

//***********************************************************************
//
// OS_AddPeriodicThread 
//
// \param task is a pointer to the function to be executed at a periodic rate
// \param period is the period to be loaded to timer register
// \param priority is the priority of the task to be used in the NVIC
//
// \return the numerical ID for the periodic thread. Error code FAIL returned
// if \param priority is out of acceptable range.
//
//***********************************************************************
int 
OS_AddPeriodicThread(void(*task)(void), unsigned long period, unsigned long priority)
{
  //Enter critical 
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();

  //Initialization for Jitter calculation:
  MaxJitterA = 0;       // OS_Time in 20ns units
  MinJitterA = 10000000;
  MaxJitterB = 0;       // OS_Time in 20ns units
  MinJitterB = 10000000;

  //Check for timer availiability
  OS_bWait(&PeriodicTimerMutex);
  if(TimerAFree){
    TimerAFree = 0;  //False
	OS_bSignal(&PeriodicTimerMutex);
	PeriodicTaskA = task;
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER3);
	TimerDisable(TIMER3_BASE, TIMER_A);
    // Set the global timer configuration.
    HWREG(TIMER3_BASE + 0x00000000) = (TIMER_CFG_16_BIT_PAIR|TIMER_CFG_A_PERIODIC) >> 24;
    // Set the configuration of the A and B timers.  Note that the B timer
    // configuration is ignored by the hardware in 32-bit modes.
    HWREG(TIMER3_BASE + 0x00000004) = (TIMER_CFG_16_BIT_PAIR|TIMER_CFG_A_PERIODIC) & 255;
    TimerLoadSet(TIMER3_BASE, TIMER_A, period);
	PeriodTimerA = (long)period;
    TimerIntEnable(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
    TimerIntClear(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
    IntEnable(INT_TIMER3A);                                                                                
    if(priority < 8){
      IntPrioritySet(INT_TIMER3A,(((unsigned char)priority)<<5)&0xF0);
    }
    else{
//      IntMasterEnable();
	   OS_EXITCRITICAL();
	   return FAIL; 
    }
    TimerEnable(TIMER3_BASE, TIMER_A);
	//Exit critical 
//    IntMasterEnable();
    OS_EXITCRITICAL();
	return SUCCESS;
  }
  else if(TimerBFree){
    TimerBFree = 0;  //False
	OS_bSignal(&PeriodicTimerMutex);
	PeriodicTaskB = task;
	TimerDisable(TIMER3_BASE, TIMER_B);
    // Set the global timer configuration.
    HWREG(TIMER3_BASE + 0x00000000) = (TIMER_CFG_16_BIT_PAIR|TIMER_CFG_B_PERIODIC) >> 24;
    // Set the configuration of the A and B timers.  Note that the B timer
    // configuration is ignored by the hardware in 32-bit modes.
    HWREG(TIMER3_BASE + 0x00000008) = ((TIMER_CFG_16_BIT_PAIR|TIMER_CFG_B_PERIODIC)>> 8) & 255;
    TimerLoadSet(TIMER3_BASE, TIMER_B, period);
	PeriodTimerB = (long)period;
    TimerIntEnable(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
    TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
    IntEnable(INT_TIMER3B);                                                                                
    if(priority < 8){
      IntPrioritySet(INT_TIMER3B,(((unsigned char)priority)<<5)&0xF0);
    }
    else{
//       IntMasterEnable();
      OS_EXITCRITICAL();
	  return FAIL; 
    }
    TimerEnable(TIMER3_BASE, TIMER_B);
	//Exit critical 
//    IntMasterEnable();
    OS_EXITCRITICAL();
	return SUCCESS;
  }
  
  OS_bSignal(&PeriodicTimerMutex);
  //Exit critical 
  OS_EXITCRITICAL();
  return FAIL;
}

//***********************************************************************
//
// OS_Launch starts the OS on the first thread in the circular linked list
// of threads.
//
// \param period is the timeslice of the OS, the execution time share for 
// each thread.
//
// \retun none.
//
//***********************************************************************
void
OS_Launch(unsigned long period)
{
  //The first thread is the one at the beginning of the list
  CurrentThread = ThreadList;
  PerThreadSwitchInit(period);
  LaunchInternal(CurrentThread->stackPtr);  //doesn't return  
}

//***********************************************************************
//
// OS_Sleep puts a thread to sleep for a given number of milliseconds
//
//***********************************************************************
void
OS_Sleep(unsigned long sleepCount)
{
  // Put the thread to sleep by loading a value into the sleep counter
  CurrentThread->sleepCount = sleepCount;

  // Pass control to the next thread
  TriggerPendSV();  
}

//***********************************************************************
//
//  OS_Suspend causes control to be passed to the next thread in the 
//  list without the allotted timeslice timing out.
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_Suspend(void)
{
  TriggerPendSV();  
}

//***********************************************************************
//
// OS_Kill removes the current thread from the linked list.  This 
// function does not change the CurrentThread pointer so that the
// current thread can finish and the next thread switch will be
// correct.
//
// \param none.
// \return none. 
//
//***********************************************************************
void 
OS_Kill(void)
{
  // Start the search pointer at the beginning of the list
  TCB * searchPtr = ThreadList;

  // Search the list and find the thread that points to the
  // one to be removed.
  while((searchPtr->next) != CurrentThread)
  {
    searchPtr = searchPtr->next;
  }

  // Remove the current thread from the linked list by assigning
  // the pointer of the previous thread to the thread ahead of the
  // element to be removed. 
  searchPtr->next = CurrentThread->next;

  // Indicate to AddThread that this spot is open
  CurrentThread->id = DEAD;

