dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  // Set the period in ms
  SysTickPeriodSet(period);

  // Set Systick priority to high, PendSV priority to low
  IntPrioritySet(FAULT_SYSTICK,(((unsigned char)0)<<5)&0xF0);
  IntPrioritySet(FAULT_PENDSV,(((unsigned char)7)<<5)&0xF0);
  
  // Enable the SysTick module  
  SysTickEnable();

  return SUCCESS;
}

//***********************************************************************
//
// Timer 3A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
long timeCheck;
void
Timer3AIntHandler(void)
{
  int index;
  static unsigned long LastTime;  // time at previous interrupt  
  unsigned long thisTime;         // time at current interrupt
  long jitter;                    // time between measured and expected

  if(NumSamples < RUNLENGTH){
    // Jitter calculation:
    thisTime = OS_Time();       // current time, 20 ns
    timeCheck = OS_TimeDifference(thisTime, LastTime);
    jitter = ((OS_TimeDifference(thisTime, LastTime)-PeriodTimerA)*CLOCK_PERIOD)/1000;  // in usec
	if(jitter > MaxJitterA){
      MaxJitterA = jitter;
    }
    if(jitter < MinJitterA){
      MinJitterA = jitter;
    }        // jitter should be 0
    index = jitter+JITTERSIZE/2;   // us units
    if(index<0)index = 0;
    if(index>=JitterSize)index = JITTERSIZE-1;
    JitterHistogramA[index]++; 
    LastTime = thisTime;
  }
  // Execute the periodic thread
  TimerIntClear(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
  PeriodicTaskA();  
}

//***********************************************************************
//
// Timer 3B Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer3BIntHandler(void)
{
  static unsigned long LastTime;  // time at previous interrupt  
  unsigned long thisTime;         // time at current interrupt
  long jitter;                    // time between measured and expected
  int index;
 
  if(NumSamples < RUNLENGTH){
    // Jitter calculation:
    thisTime = OS_Time();       // current time, 20 ns
    timeCheck = OS_TimeDifference(thisTime, LastTime);
    jitter = ((OS_TimeDifference(thisTime, LastTime)-PeriodTimerB)*CLOCK_PERIOD)/1000;  // in usec
	if(jitter > MaxJitterB){
      MaxJitterA = jitter;
    }
    if(jitter < MinJitterB){
      MinJitterA = jitter;
    }        // jitter should be 0
    index = jitter+JITTERSIZE/2;   // us units
    if(index<0)index = 0;
    if(index>=JitterSize)index = JITTERSIZE-1;
    JitterHistogramB[index]++; 
    LastTime = thisTime;
  }
  // Execute Periodic task
  TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
  PeriodicTaskB();  
}

//***********************************************************************
//
// Timer 2A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer2IntHandler(void)
{
//  IntMasterDisable();
  
  //If the button is still pressed, execute the user task.
  if(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1))
  {
    ButtonTask();
  }
  //Wait for the user to release the button
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));
  
  //Debounce for 10ms
  //SysCtlDelay((SysCtlClockGet()/1000)*10);

  //Re-read switch to make sure it is unpressed.
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));

  //Clear the interrupt
  GPIOPinIntClear(GPIO_PORTF_BASE, GPIO_PIN_1);
  
  TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);

//  IntMasterEnable();  
}

//***********************************************************************
//
// SysTick handler, enables PendSV for thread switching.
//
//***********************************************************************

void
SysTickThSwIntHandler(void)
{   
  TriggerPendSV();
}

//***********************************************************************
//
// PendSV handler, switches threads.  Disables interrupts during execution.
//
//***********************************************************************
void 
PendSVHandler(void)
{
  TCB * TempPt;
  static unsigned long RunPriorityLevel;
  long sr;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  
  //Determine the priority level to run	and update sleeping threads
  RunPriorityLevel = 100;     //Initialize to rediculously low priority
  TempPt = ThreadList;
  do
  {
    // Find lowest active priority level
    if((TempPt->BlockPt == NULL)&&(TempPt->priority < RunPriorityLevel)&&(TempPt->sleepCount == 0))
	{
        RunPriorityLevel = TempPt->priority;
	}
	  // Decrement sleep counter on sleeping threads
    if(TempPt->sleepCount > 0)
	{
      (TempPt->sleepCount)--;
	}
	TempPt = TempPt->next;
  }while(TempPt != ThreadList);


  // Find the next thread that is not...
  // (1) Sleeping
  // (2) Blocked or
  // (3) Too low in priority
  NextThread = CurrentThread->next;
  while((NextThread->sleepCount != 0)||(NextThread->BlockPt != NULL)||(NextThread->priority > RunPriorityLevel))
  {
    NextThread = NextThread->next;
  }
  
  HWREG(NVIC_ST_CURRENT) = 0;
  OS_EXITCRITICAL();
 
  SwitchThreads();  
}

//***********************************************************************
//
// Select switch interrupt handler.  Executes task set by OS_AddButtonTask.
//
//***********************************************************************
void
SelectSwitchIntHandler(void)
{
  //
  // Enable Timer2 module
  //
  SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

  //
  // Configure Timer2 as a 32-bit one-shot timer.
  //
  TimerConfigure(TIMER2_BASE, TIMER_CFG_32_BIT_OS);

  //
  // Set the Timer2 load value to generate the period specified by the user.
  //
  // 1000 at 50Mhz = 20us
  TimerLoadSet(TIMER2_BASE, TIMER_BOTH, 100000);

  //
  // Enable the Timer2 interrupt.
  //
  TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  IntEnable(INT_TIMER2A);                                                                                
  //
  // Start Timer2.
  //
  TimerEnable(TIMER2_BASE, TIMER_BOTH);
  GPIOPinIntDisable(GPIO_PORTF_BASE, GPIO_PIN_1);
}
 
//******************************EOF**************************************




